app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.create(post_params)
---
INSERT INTO "posts" ("caption", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["caption", "Foxy"], ["created_at", "2019-12-08 20:37:36.408250"], ["updated_at", "2019-12-08 20:37:36.408250"], ["user_id", 1]]

  def index
    @posts = Post.all.sortedbymostrecent
---
SELECT "posts".* FROM "posts"

  def like
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def unlike
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]